___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

# key of the dictionary is the index of a dataframe

In [24]:
d=      {'A':[1,np.nan,1],
         'B':[3,66,np.nan],
         'C':[55,4,np.nan]}

In [25]:
df=pd.DataFrame(d)
df

     A     B     C
0  1.0   3.0  55.0
1  NaN  66.0   4.0
2  1.0   NaN   NaN

In [26]:
df.dropna()

     A    B     C
0  1.0  3.0  55.0

In [27]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [28]:
df.dropna(thresh=2)

     A     B     C
0  1.0   3.0  55.0
1  NaN  66.0   4.0

In [30]:
df

     A     B     C
0  1.0   3.0  55.0
1  NaN  66.0   4.0
2  1.0   NaN   NaN

In [31]:
df.fillna(value='ashik')

       A      B      C
0    1.0    3.0   55.0
1  ashik   66.0    4.0
2    1.0  ashik  ashik

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Great Job!